#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2021/2/9 10:51
# @Author  : cendeavor
# @Site    : 
# @File    : symptom.py
# @Software: PyCharm

# DSM-5
symptoms_dsm_5 = {
    # 1. 抑郁心境：感到哀伤、空洞、绝望等
    "depressive_mood": "长时间不开心、不高兴、不快乐，心情低落消沉、郁闷压抑、沮丧或绝望，经常总是悲伤想哭、伤心流泪、痛苦难过、感到空虚难熬惆怅",
    # 2. 显著的日常（娱乐）活动的减少: 做事时提不起劲或没有兴趣
    "interest_pleasure_loss": "对几乎所有活动没兴趣、没意思没动力，乐趣明显减少、没有愉悦感，厌世、成天无精打采",
    # 3. 胃口或体重明显改变：食欲不振或吃太多,在未节食的情况下体重明显减轻，或体重增加
    "appetite_weight_problem": "食欲减退、经常饱、没胃口、想吐或食欲增加、不明原因暴食，体重明显减轻或体重增加",
    # 4. 睡眠困扰：入睡困难、睡不安稳，或睡眠过多
    "insomnia_or_hypersomnia": "经常失眠睡不着、服用安眠药，凌晨发帖时间多，嗜睡、起床困难、睡不醒",
    # 5. 日常行动迟缓或多动：动作或说话速度缓慢到别人已经觉察; 烦躁或坐立不安、动来动去的情况更胜于平常
    "retardation_or_agitation": "反应麻木迟钝、动作迟缓，对疼痛不敏感；精神性躁动、易感烦躁、坐立难安，言行冲动、易怒、易抓狂",
    # 6. 感到劳累： 感觉疲倦或精力不足
    "energy_loss": "经常感到累、困、昏晕乏力、疲惫没力气、没有精神",
    # 7. 感到无用，自责：觉得自己很糟，或觉得自己很失败，或让自己或家人失望
    "self_blame": "经常自我否定，我好没用、没有价值、一无是处、一事无成、好失败，让自己或家人失望，经常对不起、内疚自责、都是我的错",
    # 8. 无法集中注意力，决策力下降：对事物专注有困难，例如阅读报纸或看电视时不能集中注意力
    "concentration_problem": "注意力下降、无法专注、感到集中注意力困难、思考能力减退、犹豫不决、精神恍惚",
    # 9. 不断地想到死亡，自杀念头但是没有计划：有不如死掉或用某种方式伤害自己的念头
    "suicidal_ideation": "反复想到死亡、想死、自杀、结束生命，用刀片割腕自残、想跳楼自杀、计划自杀",
    # 10. 交感神经唤醒
    "sympathetic_arousal": "心慌、心悸、胸闷、喘不过气、颤抖、视力模糊、冒冷汗",
    # 11. 恐慌&焦虑：对于特定的物体有显著的恐惧和焦虑或者逃避，且持续呈现；
    "panic_and_anxious": "经常好怕、害怕、恐惧、恐慌，想逃避；浑身躁动、经常烦躁、焦躁不安、焦虑、过度紧张、过度担心、忐忑、精神紧绷"
}

# DSM-5结合论文
symptoms_combined = {
    # 1. 抑郁心境：感到哀伤、空洞、绝望等
    "depressive_mood": "长时间不开心、不高兴、不快乐，心情低落消沉、郁闷压抑、沮丧或绝望，经常总是悲伤想哭、伤心流泪、痛苦难过、感到空虚难熬惆怅",
    # 2. 显著的日常（娱乐）活动的减少: 做事时提不起劲或没有兴趣
    "interest_pleasure_loss": "对几乎所有活动没兴趣、没意思没动力，乐趣明显减少、没有愉悦感，厌世、成天无精打采",
    # 3. 胃口或体重明显改变：食欲不振或吃太多,在未节食的情况下体重明显减轻，或体重增加
    "appetite_weight_problem": "食欲减退、经常饱、没胃口、想吐或食欲增加、不明原因暴食，体重明显减轻或体重增加",
    # 4. 睡眠困扰：入睡困难、睡不安稳，或睡眠过多
    "insomnia_or_hypersomnia": "经常失眠睡不着、服用安眠药，凌晨发帖时间多，嗜睡、起床困难、睡不醒",
    # 5. 日常行动迟缓：动作或说话速度缓慢到别人已经觉察;
    "retardation": "反应麻木迟钝、动作迟缓，对疼痛不敏感",
    # 6. 感到劳累： 感觉疲倦或精力不足
    "energy_loss": "经常感到累、困、昏晕乏力、疲惫没力气、没有精神",
    # 7. 感到无用，自责：觉得自己很糟，或觉得自己很失败，或让自己或家人失望
    "self_blame": "经常自我否定，我好没用、没有价值、一无是处、一事无成、好失败，让自己或家人失望，经常对不起、内疚自责、都是我的错",
    # 8. 无法集中注意力，决策力下降：对事物专注有困难，例如阅读报纸或看电视时不能集中注意力
    "concentration_problem": "注意力下降、无法专注、感到集中注意力困难、思考能力减退、犹豫不决、精神恍惚",
    # 9. 不断地想到死亡，自杀念头但是没有计划：有不如死掉或用某种方式伤害自己的念头
    "suicidal_ideation": "反复想到死亡、想死、自杀、结束生命，用刀片割腕自残、想跳楼自杀、计划自杀",
    # 10. 交感神经唤醒
    "sympathetic_arousal": "心慌、心悸、胸闷、喘不过气、颤抖、视力模糊、冒冷汗",
    # 11. 恐慌&焦虑&狂躁：对于特定的物体有显著的恐惧和焦虑或者逃避，且持续呈现；烦躁或坐立不安、动来动去的情况更胜于平常
    "panic_and_anxious_or_agitation": "经常好怕、害怕、恐惧、恐慌，想逃避；浑身躁动、经常烦躁、焦躁不安、坐立难安、焦虑、过度担心、紧张、忐忑、精神紧绷；言行冲动、易怒、易抓狂"
}

# 纯粹按照论文
symptoms_disaggregate = {
    # 1. 感到劳累： 感觉疲倦或精力不足
    "energy_loss": "经常感到累、困、昏晕乏力、疲惫没力气、没有精神",
    # 2. 抑郁心境：感到哀伤、空洞、绝望等
    "sadness": "心情低落消沉、郁闷压抑、沮丧或绝望，经常总是悲伤想哭、伤心流泪、痛苦难过、感到空虚难熬惆怅",
    # 3. 交感神经唤醒
    "sympathetic_arousal": "心慌、心悸、胸闷、喘不过气、颤抖、视力模糊、冒冷汗",
    # 4. 显著的日常（娱乐）活动的减少: 做事时提不起劲或没有兴趣
    "interest_loss": "对几乎所有活动没兴趣、没意思没动力、厌世、成天无精打采",
    # 5. 感受不到快乐，愉悦感消失
    "pleasure_loss": "乐趣明显减少、没有愉悦感，感受不到快乐、不开心、不高兴",
    # 6. 无法集中注意力，决策力下降：对事物专注有困难，例如阅读报纸或看电视时不能集中注意力
    "concentration_problem": "注意力下降、无法专注、感到集中注意力困难、思考能力减退、犹豫不决、精神恍惚",
    # 7. 恐慌：对于特定的物体有显著的恐惧和焦虑或者逃避，且持续呈现
    "panic": "经常好怕、害怕、恐惧、恐慌，想逃避",
    # 8. 胃口或体重明显改变：食欲不振或吃太多,在未节食的情况下体重明显减轻，或体重增加
    "appetite_problem": "食欲减退、经常饱、没胃口、想吐，食欲增加、不明原因暴食",
    # 9. 失眠：入睡困难、睡不安稳
    "insomnia": "经常失眠睡不着、服用安眠药，凌晨发帖时间多",
    # 10. 焦虑：对于特定的物体有显著的恐惧和焦虑或者逃避，且持续呈现
    "anxious": "浑身躁动、经常烦躁、焦躁不安、焦虑、过度紧张、过度担心、忐忑、精神紧绷",
    # 11. 感到无用，自责：觉得自己很糟，或觉得自己很失败，或让自己或家人失望
    "self_blame": "经常自我否定，我好没用、没有价值、一无是处、一事无成、好失败，让自己或家人失望，经常对不起、内疚自责、都是我的错",
    # 12. 日常行动迟缓或多动：动作或说话速度缓慢到别人已经觉察; 烦躁或坐立不安、动来动去的情况更胜于平常
    "retardation": "反应麻木迟钝、动作迟缓，对疼痛不敏感",
    # 9. 不断地想到死亡，自杀念头但是没有计划：有不如死掉或用某种方式伤害自己的念头
    "suicidal_ideation": "反复想到死亡、想死、自杀、结束生命，用刀片割腕自残、想跳楼自杀、计划自杀",
    # 8. 胃口或体重明显改变：食欲不振或吃太多,在未节食的情况下体重明显减轻，或体重增加
    "weight_problem": "体重明显减轻或体重增加",
    # 15. 狂躁：烦躁或坐立不安、动来动去的情况更胜于平常
    "agitation": "精神性躁动、易感烦躁、坐立难安，言行冲动、易怒、易抓狂",
    # 16. 嗜睡：睡眠过度
    "hypersomnia": "嗜睡、起床困难、睡不醒",
}

a = {
    # 1. 显著的日常（娱乐）活动的减少: 做事时提不起劲或没有兴趣
    "interest_loss": "对几乎所有活动兴趣减少",
    # "keywords": ["兴趣", "没意思", "无精打采", "厌世", "动力"]  # "没兴趣"
    # 2. 快感消失：感到心情低落、沮丧或绝望
    "pleasure_loss": "长时间开心不起来，没有愉悦感",
    # "keywords": ["不开心", "不高兴", "不快乐", "郁闷", "压抑", "难熬", "消沉", "低落", '丧']
    # 3. 感到劳累： 感觉疲倦或没有活力
    "energy_loss": "乏力，经常性疲惫，没有精神",
    # "keywords": ["累", "没力气", "发软", "躺", "困", "昏", "晕"]
    # 4. 抑郁心境：感到哀伤，空洞，绝望等
    "sadness": "悲伤、空虚、无望",
    # "keywords": ["哭", "伤心", "难受", "痛苦", "惆怅", "难过"]
    # 5. 交感神经唤醒
    "sympathetic_arousal": "心悸、颤抖、视力模糊、冒冷汗",
    # "keywords": ["心悸", "颤抖", "模糊", "冒汗", "冷汗", "胸闷", "心慌"]
    # 6. 无法集中注意力，决策力下降：对事物专注有困难，例如阅读报纸或看电视时不能集中注意力
    "concentration_problem": "思考或注意力集中的能力减退或犹豫不决、出现精神恍惚",
    # "keywords": ["注意力", "不集中"]
    # 7. 恐慌：对于特定的物体有显著的恐惧和焦虑或者逃避，且持续呈现
    "panic": "经常无故感到害怕",
    # "keywords": ["好怕", "恐惧", "恐慌", "害怕"]  # 怕
    # 8. 胃口的改变：食欲不振或吃太多
    "appetite_problem": "食欲减退、经常没胃口、呕吐或食欲增加、不明原因暴饮暴食",
    # "keywords": ["吐", "没胃口", "饱", "暴食"]
    # 9. 睡眠困扰（失眠或轻度睡眠困扰）：入睡困难、睡不安稳
    "insomnia": "自述经常失眠、凌晨0-6点发帖时间较多",
    # "keywords": ["安眠药", "失眠", "睡不着"]
    # 10. 焦虑：浑身躁动，时刻感到十分烦恼
    "anxious": "经常感到焦躁不安，包含了紧张、过度担心",
    # "keywords": ["焦虑", "紧张", "担心", "紧绷", "喘不过气", "忐忑"]
    # 11. 感到无用，自责：觉得自己很糟，或觉得自己很失败，或让自己或家人失望
    "self_blame": "感到愧疚或没有价值",
    # "keywords": ["对不起", "没用", "一无是处", "不中用", "自我否定", "一事无成", "孤独"]  # "错",
    # 12. 日常行动迟缓：动作或说话速度缓慢到别人已经觉察
    "retardation": "反应不敏捷，对疼痛不敏感",
    # "keywords": ["麻木", "笨"]  # "慢",
    # 13. 不断地想到死亡，自杀念头但是没有计划：有不如死掉或用某种方式伤害自己的念头
    "suicidal_ideation": "重复地想到死亡，重复地想到自杀但是没有详细计划，自杀尝试或者明确的自杀计划",
    # "keywords": ["自杀", "结束", "死", "自残"]
    # 14. 体重的明显改变: 在未节食的情况下体重明显减轻，或体重增加
    "weight_problem": "",
    # "keywords": ["变重", "变轻"]  # "肥", "瘦"
    # 15. 日常行为的多动：烦躁或坐立不安、动来动去的情况更胜于平常
    "agitation": "精神性躁动，言语偏激、易怒",
    # "keywords": ["烦", "抓狂", "冲动", "易怒"]
    # 16. 嗜睡：睡眠过多
    "hypersomnia": "",
    # "keywords": ["懒", "起床", "嗜睡", "睡不醒"]
}
